#include <iostream>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Russian");
	int x;
	cout << "Введите стоимость товара в копейках: ";
	cin >> x;
	if (99 >= x >= 1)
	{
		if (x == 1)
		{
			cout << x << " копейка";

		}
		else if (2 <= x <= 4)
		{
			cout << x << " копейки";
		}
		else
		{
			cout << x << " копеек";
		}
	}
	else if (100 <= x <= 9999)
	{
		if (x / 100 == 1 && x % 100 == 1)
		{
			cout << x / 100 << " рубль " << x % 100 << " копейка";

		}
		else if (2 <= x / 100 <= 4 && x % 100 == 1)
		{
			cout << x / 100 << " рубля " << x % 100 << " копейка";
		}
		else if (x >= 5 && x % 100 == 1)
		{
			cout << x / 100 << " рублей " << x % 100 << " копейка";
		}
		else if (x / 100 == 1 && 2 <= x % 100 <= 4)
		{
			cout << x / 100 << " рубль " << x % 100 << " копейки";
		}
		else if (2 <= x / 100 <= 4 && 2 <= x % 100 <= 4)
		{
			cout << x / 100 << " рубля " << x % 100 << " копейки";
		}
		else if (x >= 5 && 2 <= x % 100 <= 4)
		{
			cout << x / 100 << " рублей " << x % 100 << " копейки";
		}
		else if (x / 100 == 1 && x % 100 >= 5)
		{
			cout << x / 100 << " рубль " << x % 100 << " копеек";
		}
		else if (2 <= x / 100 <= 4 && x % 100 >= 5)
		{
			cout << x / 100 << " рубля " << x % 100 << " копеек";
		}
		else if (x >= 5 && x % 100 >= 5)
		{
			cout << x / 100 << " рублей " << x % 100 << " копеек";
		}
	}
	else
	{
		cout << "Введённое значение выходит за пределы нормы!";
	}
	return(0);
}
